<template>
  <div id="app">
    <!--
      由于每次当从主页面请求数据后，点击进入城市搜索页面，页面的钩子函数会请求一次ajax请求，当退出该页面，再重新进入该页面，会再重新发送一边相同
      的ajax请求，所以此时，我们需要对Ajax的请求进行优化。此时通过view自带的keep-alive标签来进行请求的优化。keep-alive的含义是：当我路由中的
      内容被加载过一次时，我就把路由中的内容放到内存之中，下一次再请求此路由时，不需要再重新渲染该组件，重新执行钩子函数，只需要在内存中将内存
      中的内容拿出来，显示到页面即可
      由于每个页面都会做缓存，因此在请求详情页时，我们是希望通过路由传递的参数来发送ajax请求，然而实际上由于缓存机制的存在。当我们从一个详情页
      跳转到另一个详情页时，虽然传递的id发生了变化。但实际并未重新发送ajax请求，而是使用缓存中的数据。因此，我们需要避免再次使用缓存中的数据
      所以，我们通过exclude来是Detail组件中的请求不再使用缓存中的内容。
     -->
    <keep-alive exclude="Detail">
      <router-view/>
    </keep-alive>
  </div>
</template>

<script>
export default {
  name: 'App'
}
</script>

<style>
</style>
